{
  "teams": [
    {
      "name": "Group 1",
      "subteams": [
        {
          "name": "Sub-Group 1",
          "relationship": 1,
          "description": "Sub-Group 1's relationship score is low due to recent communication breakdowns among team members. Improvements can be made by implementing regular team meetings and fostering an open communication culture."
        },
        {
          "name": "Sub-Group 2",
          "relationship": 2,
          "description": "Sub-Group 2 excels in collaborative efforts, contributing to a moderate relationship score. To enhance teamwork, encouraging cross-functional projects and team-building activities would be beneficial."
        },
        {
          "name": "Sub-Group 3",
          "relationship": 1,
          "description": "Sub-Group 3 faces challenges due to unclear roles and responsibilities, leading to a low relationship score. Defining clear objectives and establishing accountability frameworks can help improve team dynamics."
        },
        {
          "name": "Sub-Group 4",
          "relationship": 3,
          "description": "Sub-Group 4 maintains a good relationship score attributed to strong leadership and effective conflict resolution strategies. Sustaining this requires continuous leadership development and periodic team evaluations."
        }
      ]
    },
    {
      "name": "Group 2",
      "subteams": [
        {
          "name": "Sub-Group 1",
          "relationship": 3,
          "description": "Sub-Group 1 demonstrates high collaboration and commitment to project success, resulting in an excellent relationship score. To sustain this, maintaining clear communication channels and celebrating achievements are crucial."
        },
        {
          "name": "Sub-Group 2",
          "relationship": 4,
          "description": "Sub-Group 2 excels in innovation and teamwork, leading to an outstanding relationship score. To sustain this, fostering a culture of creativity and investing in continuous learning opportunities would be beneficial."
        },
        {
          "name": "Sub-Group 3",
          "relationship": 2,
          "description": "Sub-Group 3 maintains a moderate relationship score with occasional communication challenges. Enhancing feedback mechanisms and promoting cross-departmental collaborations can improve overall performance."
        }
      ]
    },
    {
      "name": "Group 3",
      "subteams": [
        {
          "name": "Sub-Group 1",
          "relationship": 2,
          "description": "Sub-Group 1 is focused on improving inter-departmental communication and streamlining workflow processes, contributing to a moderate relationship score. Sustaining this involves regular performance assessments and adapting to industry trends."
        },
        {
          "name": "Sub-Group 2",
          "relationship": 3,
          "description": "Sub-Group 2 excels in collaborative problem-solving and teamwork, contributing to a good relationship score. To sustain this, fostering a culture of continuous improvement and investing in employee development is essential."
        },
        {
          "name": "Sub-Group 3",
          "relationship": 1,
          "description": "Sub-Group 3 faces challenges due to recent conflicts arising from differing work styles, leading to a low relationship score. To improve, promoting team cohesion through team-building activities and conflict resolution training is necessary."
        },
        {
          "name": "Sub-Group 4",
          "relationship": 4,
          "description": "Sub-Group 4 excels in cross-functional synergy and effective communication channels, resulting in an exceptional relationship score. Sustaining this requires fostering a culture of mutual respect and leveraging diversity."
        }
      ]
    },
    {
      "name": "Group 4",
      "subteams": [
        {
          "name": "Sub-Group 1",
          "relationship": 4,
          "description": "Sub-Group 1 demonstrates strong team cohesion and strategic alignment with organizational goals, contributing to a high relationship score. To sustain this, fostering innovation and providing professional development opportunities are crucial."
        },
        {
          "name": "Sub-Group 2",
          "relationship": 2,
          "description": "Sub-Group 2 maintains a moderate relationship score with solid collaboration efforts but occasional communication gaps. Enhancing project management practices and promoting knowledge sharing can improve team performance."
        }
      ]
    },
    {
      "name": "Group 5",
      "subteams": [
        {
          "name": "Sub-Group 1",
          "relationship": 1,
          "description": "Sub-Group 1 faces challenges due to recent turnover and team restructuring, leading to a low relationship score. To improve, rebuilding trust and fostering a supportive work environment are essential."
        },
        {
          "name": "Sub-Group 2",
          "relationship": 3,
          "description": "Sub-Group 2 maintains a good relationship score attributed to effective collaboration and proactive problem-solving. Sustaining this involves continuous feedback and adapting to changing project demands."
        },
        {
          "name": "Sub-Group 3",
          "relationship": 2,
          "description": "Sub-Group 3 faces moderate challenges in team dynamics. Improving trust through transparent communication and promoting shared goals can enhance team cohesion and performance."
        }
      ]
    }
  ]
}
